#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <ctype.h>
#include <stdbool.h>
#define DEBUG printf("---debug位置---\n行号:%d\n文件名:<%s>",__LINE__,__FILE__);getchar();

#include <../include/config.h>
#include <../include/Chess_Operate.h>

GYF_Debug_Mode *gyf_debug_mode = NULL;
ColorCode *color=NULL;
// 0红，1黑
short current_player=0;
short 第几回合=0;

/*
《调试模式设置》
GYF_Debug_Mode->DoesMsgPrint：是否进行debug信息输出。
GYF_Debug_Mode->DoesTest：是否进行特定情况测试。（例如强制固定一个值，观察变化。）

当前测试：
只在141行那一句让选到的棋子坐标固定为0
而落点是由坐标计算的
所以举棋仍然是正常的索引，但落点是不正常的
这样落点可以固定在第1行、第1列
而开局我只摆6枚棋子
而这棋盘暂时设为5列6行
所以这样容易发生吃子来测试
*/
void GYF_Debug_Mode_init(GYF_Debug_Mode *self)
{	
	self->DoesMsgPrint=false;
	
	self->DoesTest=false;
	
	// 固定落棋范围：用坐标控制
	self->固定落棋范围 = 0;
	
	// 固定选棋
	self->固定选棋范围 = "Cc";
}



// 对结构体TheStep进行操作的函数：查看即将落棋的这一步着法情况
void TheStep_show(TheStep *self)
{
	printf("from_x:%d\tfrom_y:%d\n"
	       "from_coord:(%d, %d)\n"
	"from:%d\tflip_to:%d\nmove_to:%d\n",
	
	self->from_x, self->from_y,
	self->from_coord[0], self->from_coord[1],
	self->from_index, self->to_index_of_flip, self->to_index_of_move);
}

// 用于查看例如全场（红方/黑方）棋子索引数组
void show_整数数组(short *arr, short size, const char *prompt)
{
	printf(prompt);
	putchar('[');
	for (short i=0, *p=arr; i<size; i++, p++)
	{
		printf("%d",*p);
		i+1<size?putchar(','):false;
	}
	putchar(']');
}

// 对结构体Game进行操作的函数：随时查看场上棋子的索引数组情况
void Game_show(Game *self)
{
	printf("🔎\n查看Game结构体信息");
	
	show_整数数组(self->全场棋子的索引数组, self->全场棋子数量, "全场棋子的索引数组");
	putchar(10);
	
	printf("全场棋子数量：%d\n",self->全场棋子数量);
	
	show_整数数组(self->黑棋索引数组, self->黑棋数量, "黑棋索引数组"); putchar(10);
	printf("黑棋数量：%d\n",self->黑棋数量);
	
	show_整数数组(self->红棋索引数组, self->红棋数量, "红棋索引数组"); putchar(10);
	printf("红棋数量：%d\n",self->红棋数量);
	
	show_整数数组(self->当前操作方的棋子的索引数组, self->当前操作方的棋子数量, "当前操作方的棋子的索引数组"); putchar(10);
	printf("当前操作方的棋子数量：%d\n",self->当前操作方的棋子数量);
	
	show_整数数组(self->当前应对方的棋子的索引数组, self->当前应对方的棋子数量, "当前应对方的棋子的索引数组"); putchar(10);
	printf("当前应对方的棋子数量：%d\n",self->当前应对方的棋子数量);getchar();
	
	
}


void 交换两个指针值(void **ofsv, void **defsv)
{
	// 函数内交换两个指针值
	// 所以必须得到该指针的引用（存储该指针的内存空间）
	// void 接收任意类型（会自动转换成需要的类型）
	// void **与void *[]等价	
	
	/* 如果操作方是红方，则切换到黑方。
	如果ofsv是red，defsv是black；
	则切换到ofsv是black，defsv是red。
	*/
	void **temp = ofsv;
	*ofsv = *defsv;
	*defsv = *temp;
}


void Game_决定当前操作方与应对方信息(Game *game)
{
	/*
	这里没有必要这样决定的。
	没有必要大量做赋值操作。
	这一方带大量信息，那一方带大量信息。难道每次有多少就多少全部列出来赋值覆盖过来？
	只要交换两个指针值就行了。
	
	也没有必要分清楚是红方还是黑方才赋值，从而赋值同样麻烦的两遍。
	而是可以先盲选。
	再看猜没猜对。
	猜对就不用换，猜错就换。
	
	这里的问题是，被吃子的当前应对方棋子数量已经确实被修改了实参。
	当然，修改当前应对方的棋子数量并不影响红棋数量、黑棋数量。
	但在选棋之前，又先进行了决定双方信息再选棋。
	这时上一回合应对方的棋子数量又被赋值覆盖为永远没变化的红棋数量、黑棋数量。
	*/
	
	if (第几回合==1)
	{
		switch (current_player)
		{
			case 0:
			game->当前操作方的棋子的索引数组 = game -> 红棋索引数组;
			game->当前操作方的棋子数量 = game -> 红棋数量;
			game->当前应对方的棋子的索引数组 = game -> 黑棋索引数组;
			game->当前应对方的棋子数量 = game -> 黑棋数量;
			break;
			
			case 1:
			game->当前操作方的棋子的索引数组 = game -> 黑棋索引数组;
			game->当前操作方的棋子数量 = game -> 黑棋数量;
			game->当前应对方的棋子的索引数组 = game -> 红棋索引数组;
			game->当前应对方的棋子数量 = game -> 红棋数量;
			break;
			
			default:
			break;
		}
	}
	else
	{
		short temp_棋子数量, *temp_棋子的索引数组;
		
		if (gyf_debug_mode->DoesMsgPrint)
		{
		puts("⚡️决定双方信息时！");
		printf("交换棋子数量与索引数组之前：%p, %p\n", game->当前操作方的棋子的索引数组, game->当前应对方的棋子的索引数组);		
		Game_show(game);
		}
		
		// 交换当前xx方的棋子数量
		temp_棋子数量 = game->当前操作方的棋子数量;
		game->当前操作方的棋子数量 = game->当前应对方的棋子数量;
		game->当前应对方的棋子数量 = temp_棋子数量;
		
		// 交换当前xx方的索引数组
		temp_棋子的索引数组 = game->当前操作方的棋子的索引数组;
		game->当前操作方的棋子的索引数组 = game->当前应对方的棋子的索引数组;
		game->当前应对方的棋子的索引数组 = temp_棋子的索引数组;		
		
		if (gyf_debug_mode->DoesMsgPrint)
		{		
		printf("交换棋子数量与索引数组之后（非同步交换）：%p, %p\n", game->当前操作方的棋子的索引数组, game->当前应对方的棋子的索引数组);
		Game_show(game);
		}	
	}
}

/*
void 固定选棋范围_获取单方可选棋索引数组(GYF_Debug_Mode *self, Game *game)
{
	short current_index;
	for (short i=0;i<game->当前操作方的棋子数量;i++)
	{
		current_index = game->当前操作方的棋子的索引数组[i];
		if (strchr(self->固定选棋范围, game->chessBoard[current_index]))
		{
			current_index
		};
}
*/

// - - - 举 棋 - - -
// 举棋之选棋
void 举棋_选取被移动的棋子(Game *game, TheStep *着法)
{
	if (!game->当前操作方的棋子数量)
	{
		printf("❌无法选棋：操作方没有棋子了。");
		printf("游戏结束！");
		exit(EXIT_SUCCESS);
	}
	
	// 从当前操作方（单方）的棋子索引的列表中随机索引
	short 随机数 = rand() %  game->当前操作方的棋子数量;
	
	// 也可选指定索引的棋子
	//随机数 = 0;
	
	// 获取选到的棋子对于棋盘的索引
	着法->from_index = game->当前操作方的棋子的索引数组[随机数];
	
	// 检查选到的棋子对于棋盘的索引是否有效：出现越出棋盘情况
	if (!是否有效索引(着法->from_index))
	{
		puts("⚡️检查选到的棋子对于棋盘的索引是否有效：出现越出棋盘情况");
		printf("❌%s选到的棋子索引是%d\n",game->当前操作方名称, 着法->from_index);
		printf("❌索引大错！必须检查场上棋子的操作方索引数组！");
		puts("🔎\n正在检查");
		Game_show(game);
		exit(EXIT_FAILURE);
	}

}

/*
更新着法落点。
已支持可活动范围的：
车、马、炮。
*/
void TheStep_update_toIndexOfMove(Game *game, TheStep *着法)
{
	switch (tolower(game->chessBoard[着法->from_index]))
	{
		case 'c':
		着法->to_index_of_move = 车的可活动范围缩小及准备移动到的随机落点(game->chessBoard, 着法->from_coord);
		break;
		
		case 'm':
		着法->to_index_of_move = 马的可活动范围缩小及准备移动到的随机落点(game->chessBoard, 着法->from_coord);
		break;
		
		case 'p':
		着法->to_index_of_move = 炮的可活动范围缩小及准备移动到的随机落点(game->chessBoard, 着法->from_coord);
		break;		
		
		default:
		着法->to_index_of_move = -1;
		break;
	}
}

// 举棋之选棋与可落点计算
void 举棋_完全随机(Game *game, TheStep *着法)
{
	start:
	// 获取选到的棋子对于棋盘的索引
	举棋_选取被移动的棋子(game, 着法);
							
	// 显示选到的棋子信息				
	printf("选到的piece:%c from_index:%d\n",
	game->chessBoard[着法->from_index], 着法->from_index);
	getchar();
	
	// 将选到的棋子的索引转坐标
	索引转坐标(gyf_debug_mode->DoesTest?gyf_debug_mode->固定落棋范围:着法->from_index, 着法->from_coord);
	着法->from_x=着法->from_coord[0];
	着法->from_y=着法->from_coord[1];
	
	if (gyf_debug_mode->DoesMsgPrint) puts("⚡️《举棋之可落点之检查》");
	// 计算可落点以及决定落点
	TheStep_update_toIndexOfMove(game, 着法);	
	
	
	// 选到的棋子是无法移动的：需要重新选择棋子
	if (着法->to_index_of_move == -1)
	{
		printf("❗️该棋子无可落点，请重新选择棋子。\n");
		goto start;
	}
	
	char *棋子内容_中文=malloc(10);
	strcpy(棋子内容_中文, current_player?"黑":"红");
	switch (tolower(game->chessBoard[着法->from_index]))
	{
		case 'c':
		strcat(棋子内容_中文, "车");
		break;
		
		case 'm':
		strcat(棋子内容_中文, "马");
		break;

		case 'p':
		strcat(棋子内容_中文, "炮");
		break;
		
		case 'b':
		strcat(棋子内容_中文, !strcmp(棋子内容_中文, "红")?"兵":"卒");
		break;
		
		default:break;
	}
	
	
	printf("%s的本次落点索引：%d\n", 棋子内容_中文, 着法->to_index_of_move);
}

// 落棋
/*
一枚棋子的索引变化：单方可起棋索引变化
全场两个点的内容变化
全场棋子数量变化
单方棋子数量变化
*/
void 落棋(Game *game, TheStep *着法)
{
	short ofsv_from = 着法->from_index;
	short ofsv_move_to = 着法->to_index_of_move;
	char nullpos='o';
	
	puts("⚡️落棋之前看一下索引信息！");
	Game_show(game);

	/*
	from_index内容必定变空。
	move_to_index内容必定变移动的棋。
	
	move_to_index可能遇空，可能遇敌。
	遇空，基础变化。
	遇敌，除了基础变化以外，敌方可选棋子必须减少一个。
	这时，全场棋子索引必定出现重复的，要去重，所以也要减少一个。
	因为在全场棋子索引中，同样的索引，新棋刚刚占领，旧棋已经死亡，不能有双方棋同时占一个索引。
	
	棋盘内容不需要变化，因为旧棋内容已经被新棋内容覆盖。	
	*/	
	
	// 移动后必然的消失并替换
	replace_num(game->全场棋子的索引数组, ofsv_from, ofsv_move_to);
	replace_num(game->当前操作方的棋子的索引数组, ofsv_from, ofsv_move_to);
	
	// 移动后落点为吃敌子的敌消失+消失并替换（基础）
	puts("⚡️《落棋之检查》");
	puts("⚡️检查落点内容是否为敌棋：这一步是否会吃了敌棋");
	short 棋位内容是哪种情况 = 判断该棋位内容情况(game->chessBoard[ofsv_move_to]);
	if ( 棋位内容是哪种情况 == true )
	{
		printf("操作方移动到的棋位之内容:%c\n",game->chessBoard[ofsv_move_to]);
		printf("当前玩家(0红1黑):%d\n",current_player);
		printf("判断该棋位情况(-1空1敌0己):%d\n", 棋位内容是哪种情况);
		
		// 我知道此处为什么无法删除单方索引数量了。
		// 因为虽然当前应对方的棋子数量改变了，但这改变之前的值却是通过赋值得到的。
		// 想要改变红棋数量。而最初却是：当前应对方的棋子数量 = 红棋数量。
		// 那么，当前应对方的棋子数量--，怎么影响红棋数量呢？
		// 除非能够得到红棋数量的地址。
		// 就像b=3，a=b。这时a存放3。a=2，修改了a，a存放2。但b仍然存放3。
		// 所以，这就是为什么结构体重要、指针重要。比大量赋值覆盖好太多了。
		puts("⚡️《检查对当前应对方的棋子数量进行减少是否成功》");
		printf("原数量：%d\n", game->当前应对方的棋子数量);
		remove_num(game->当前应对方的棋子的索引数组, ofsv_move_to, &game->当前应对方的棋子数量);
		printf("进行删除操作后数量：%d\n", game->当前应对方的棋子数量);
		remove_num(game->全场棋子的索引数组, ofsv_move_to, &game->全场棋子数量);
	}
	
	// 完成落点
	game->chessBoard[ofsv_move_to] = game->chessBoard[ofsv_from];
	game->chessBoard[ofsv_from] = nullpos;
		
}

void 复制棋盘(char *defsv, char *ofsv)
{
	strcpy(defsv, ofsv);
}

void 切换操作方()
{
	current_player++;
	if (current_player>1)current_player=0;

}


void main()
{
	srand(time(NULL));
	
	color = (ColorCode*) malloc (sizeof (ColorCode));
	ColorCode_init(color);
	
	gyf_debug_mode = (GYF_Debug_Mode *)malloc (sizeof (GYF_Debug_Mode));
	GYF_Debug_Mode_init(gyf_debug_mode);
	
	current_player = 0;
		
	// 共用一个棋盘视图。（统一坐标系。因为倒转无意义）
	// 暂时用字符数组储存信息。以后扩展至结构体数组。
	/* Game结构体：包含信息有
	全场棋子的索引数组：用于对弈两个点之变化
	单方棋子索引数组：用于选棋范围缩小之变化
	*/
	Game *game = (Game *)malloc( sizeof (Game) );
	game->chessBoard = (char *)malloc (WIDTH * HEIGHT +1);
	
	// 每次存档一枚正在举棋或落棋的棋子的信息
	TheStep *着法 = (TheStep *) malloc ( sizeof (TheStep));
	

	// 开局棋子信息：坐标与内容
	/* 既然对应，不如：
	开局多个棋子需要什么：
	指定坐标（成员属性）
	对应内容（成员属性）
	存储多个棋子的容器
	*/
	/*
	short是2个字节。
	二维数组等于两个维度相乘的一维数组。
	每个低维装连续的横纵坐标，需要2个。
	需要6个坐标，所以高维6个。
	6*2=12。
	所以[6][2]二维数组是[12]一维数组。
	short就6*2*2=24字节。
	int就6*2*4=48字节。
	
	short *[2]不同于short[][]
	后者是存放short。
	前者是存放指针。
	一个指针是8字节。
	前者是2个指针，所以是16个字节。
	*/
	short 开局多个棋子的坐标二维数组[][2] =
	{
		/*
		规律：
		黑12 红34
		从中心往两边等距拉开
		离原点最近：2与3
		拉远：1与4
		对角线对称坐标相加：
		横坐标相加必等于最末横坐标。
		纵坐标相加必等于最末纵坐标。
		
		*/
		// 黑双车/红双车
		{0, 0}, {8, 0}, {0, 9}, {8, 9},
		// 黑双马/红双马
		{1, 0}, {7, 0}, {1, 9}, {7, 9},
		// 黑双炮/红双炮
		{1, 2}, {7, 2}, {1, 7}, {7, 7},

	};
	short 坐标数量 = sizeof (开局多个棋子的坐标二维数组) / sizeof (short ) /2;
	const char *开局多个棋子的对应内容数组 = "CCccMMmmPPpp";

	
	// 对容器内任意数量的元素进行循环轮流（以对索引进行循环轮流来实现）
	/*
	char *loop[2];
	loop[0] = malloc(5);
	loop[1] = malloc(5);
	
	strcpy(loop[0],"black");
	strcpy(loop[1],"red");
	*/


	// 棋盘无棋
	先填满默认空(game->chessBoard);
	// show_棋盘(chessBoard); getchar();
	
	// 棋盘摆棋
	摆棋(game->chessBoard, 开局多个棋子的坐标二维数组, 坐标数量, 开局多个棋子的对应内容数组);
	// show_棋盘(chessBoard); getchar();
	
	
	/*
	全场棋子的索引数组：全场对弈，两点变化
	无棋子不装
	只有有棋子就装进来
	等同于老版本的“场上棋子的操作方索引数组”
	*/
	
	// 开局场上棋子信息：索引、数量
	// （以此为基础无限变化，每次变化极小量：后续只需要进行最少且最多两个点变化引起的变化）
	
	game->全场棋子的索引数组 = (short*) malloc ( sizeof ( short ) * 坐标数量);	
	game->黑棋索引数组 = (short*) malloc ( sizeof ( short ) * 坐标数量);
	game->红棋索引数组 = (short*) malloc ( sizeof ( short ) * 坐标数量);
	
	Game_更新全场棋子的索引数组( game );
	Game_show( game );	
	
	
	/*
	// 将当前应对方的棋盘倒转
	倒转(defensive, 全场棋子数量, 全场棋子的索引数组,
		   全场棋子的倒转后索引数组);
	*/
		   
	// 开局显示一个共用棋盘
	show_棋盘(game->chessBoard); getchar();
	
	
	start:
	// - - - 棋已摆好，开始对局 - - -
	第几回合++;
	printf("第%d回合，操作方为：", 第几回合);
	if (current_player)
	{
		game->当前操作方名称 = "黑方";
		printf("%s%s",color->black,"黑方");
	}
	else
	{
		game->当前操作方名称 = "红方";
		printf("%s%s",color->red,"红方");
	}
	puts(color->reset); putchar(10);
	
	// 缩小可选棋子：场上棋子数量 -> 单方棋子数量
	Game_决定当前操作方与应对方信息(game);
	puts("⚡️决定双方信息之后，选棋之前看一下棋子信息！");
	Game_show(game);
	
	// 举棋：选棋与可落点计算
	举棋_完全随机(game, 着法);
	
	// 显示这一步棋的计划着法							 
	TheStep_show(着法);
	putchar(10);
	
	// 落棋
	/*
	一枚棋子的索引变化：单方可起棋索引变化
	全场两个点的内容变化
	全场棋子数量变化
	单方棋子数量变化
	*/
	落棋(game, 着法);
	
	// 显示单向视图棋盘
	show_棋盘(game->chessBoard); getchar();
	
	// 切换操作方
	切换操作方();
	goto start;
}